<a href="https://colab.research.google.com/github/sira-code/DS-ML-PY-projects-/blob/master/INTERNSHALA_INTERNSHIP_TASK_1_SP.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [23]:
import numpy as np 
import pandas as pd 
import matplotlib.pyplot as plt
import seaborn as sns

In [24]:
#1.WRITE A FUNCTION THAT INPUTS A DATAFRAME AND INDENTIFY WHICH COLUMNS HAVE DATE IN THEM

In [27]:
data = {'Name': ['Shiv','Daisy','Juhi','Saumya'],
'age': [20, 19, 22, 21],
'grade': [88, 92, 95, 70],
'Date_Of_start_Session': ['08-25-2016','08-29-2014','08-25-2012','08-16-2013'],
'Date_Of_End_Session': ['10-20-2020','10-27-2018','10-22-2016','10-16-2016']}

In [28]:
df = pd.DataFrame(data, index = ['Shiv','Daisy','Juhi','Saumya'])
df

          Name  age  grade Date_Of_start_Session Date_Of_End_Session
Shiv      Shiv   20     88            08-25-2016          10-20-2020
Daisy    Daisy   19     92            08-29-2014          10-27-2018
Juhi      Juhi   22     95            08-25-2012          10-22-2016
Saumya  Saumya   21     70            08-16-2013          10-16-2016

In [29]:
import datetime
df['year'] = pd.DatetimeIndex(df['Date_Of_start_Session']).year

In [30]:
df.head()

          Name  age  grade Date_Of_start_Session Date_Of_End_Session  year
Shiv      Shiv   20     88            08-25-2016          10-20-2020  2016
Daisy    Daisy   19     92            08-29-2014          10-27-2018  2014
Juhi      Juhi   22     95            08-25-2012          10-22-2016  2012
Saumya  Saumya   21     70            08-16-2013          10-16-2016  2013

In [31]:
df['month'] = pd.DatetimeIndex(df['Date_Of_start_Session']).month
df.head()

          Name  age  grade  ... Date_Of_End_Session  year  month
Shiv      Shiv   20     88  ...          10-20-2020  2016      8
Daisy    Daisy   19     92  ...          10-27-2018  2014      8
Juhi      Juhi   22     95  ...          10-22-2016  2012      8
Saumya  Saumya   21     70  ...          10-16-2016  2013      8

[4 rows x 7 columns]

In [32]:
df['day'] = pd.DatetimeIndex(df['Date_Of_start_Session']).day
df.head()

          Name  age  grade  ...  year month  day
Shiv      Shiv   20     88  ...  2016     8   25
Daisy    Daisy   19     92  ...  2014     8   29
Juhi      Juhi   22     95  ...  2012     8   25
Saumya  Saumya   21     70  ...  2013     8   16

[4 rows x 8 columns]

In [33]:
df['month_day_year'] = pd.to_datetime(df['Date_Of_start_Session']).dt.to_period('D')
df.head()

          Name  age  grade  ... month day  month_day_year
Shiv      Shiv   20     88  ...     8  25      2016-08-25
Daisy    Daisy   19     92  ...     8  29      2014-08-29
Juhi      Juhi   22     95  ...     8  25      2012-08-25
Saumya  Saumya   21     70  ...     8  16      2013-08-16

[4 rows x 9 columns]

In [34]:
# USING THESE DATE COLUMNS MAKE NEW COLUMNS WHICH ARE THE THE DIFFERENCE BETWEEN THESE COLUMNS TAKING 2 AT A TIME

In [36]:
from datetime import datetime
df[['Date_Of_start_Session','Date_Of_End_Session']]=df[['Date_Of_start_Session','Date_Of_End_Session']].apply(pd.to_datetime)

In [41]:
#date1= Date_Of_start_Session
#date2= Date_Of_End_Session
df['DIFFERENCE(date1-date2)']=(df['Date_Of_End_Session']-df['Date_Of_start_Session']).dt.days
df.head()

          Name  age  grade  ... month_day_year DIFFERENCE  DIFFERENCE(date1-date2)
Shiv      Shiv   20     88  ...     2016-08-25       1517                     1517
Daisy    Daisy   19     92  ...     2014-08-29       1520                     1520
Juhi      Juhi   22     95  ...     2012-08-25       1519                     1519
Saumya  Saumya   21     70  ...     2013-08-16       1157                     1157

[4 rows x 11 columns]